src/Catalogs/ХранилищеДополнительнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ХранилищеДополнительнойИнформации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Хранилище</Name>
					<Comment>Хранилище</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформационнаяБазаГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыИнформационныхБаз</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОтображения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ХранилищеДополнительнойИнформации/Forms/ФормаЭлементаУправляемая/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КартинкаИзХранилища = Объект.Ссылка.Хранилище.Получить();
	Если ТипЗнч(КартинкаИзХранилища) = Тип("Картинка") Тогда
		//:КартинкаИзХранилища = Новый Картинка;
		ДД = КартинкаИзХранилища.ПолучитьДвоичныеДанные(Ложь);
//		Картинка.НаборВариантов = Ложь;
		
		Картинка = ПоместитьВоВременноеХранилище(ДД, ЭтаФорма.УникальныйИдентификатор)
		//ЭтаФорма.Элементы.Декорация.Картинка = Новый Картинка(ДД);
	КонецЕсли;
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		ДатаС = Объект.ДействуетС;
		ДатаПО = Объект.ДействуетПо;
		ВремяС = УстановитьВремяВДате('00010101', Объект.ДействуетС);
		ВремяПО = УстановитьВремяВДате('00010101', Объект.ДействуетПО);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//Картинка = НовыйКартинка);

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.Хранилище = Новый ХранилищеЗначения(Новый Картинка(ПолучитьИзВременногоХранилища(Картинка)));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаСПриИзменении(Элемент)
	ДатаВремяПриИзменении("С");
КонецПроцедуры

&НаКлиенте
Процедура ДатаПОПриИзменении(Элемент)
	ДатаВремяПриИзменении("ПО");
КонецПроцедуры

&НаКлиенте
Процедура ВремяСПриИзменении(Элемент)
	ДатаВремяПриИзменении("С");
КонецПроцедуры

&НаКлиенте
Процедура ВремяПОПриИзменении(Элемент)
	ДатаВремяПриИзменении("ПО");
КонецПроцедуры

&НаКлиенте
Процедура ДатаВремяПриИзменении(СПО)
	Если СПО = "ПО" И НЕ ЗначениеЗаполнено(ЭтаФорма.ВремяПО) Тогда
		ЭтаФорма.ВремяПО = '00010101235959';
	КонецЕсли;
	Объект["Действует" + СПО] = УстановитьВремяВДате(ЭтаФорма["Дата" + СПО], ЭтаФорма["Время" + СПО]);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Процедура КартинкаНажатиеНаСервере()
	КонецПроцедуры

&НаКлиенте
Процедура КартинкаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Д = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Если Д.Выбрать() Тогда    
		Картинка = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Д.ПолноеИмяФайла), УникальныйИдентификатор);
	КонецЕсли;

	КартинкаНажатиеНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
